Autodesk.Revit.DB.Architecture.Railing.RailingCanBeHostedByElement(Autodesk.Revit.DB.ElementId)
Checks whether the specified element can be used as a host for the railing.
The host can be a stairs, ramp, floor, slab edge, wall or roof.
hostId:
Element id to check.
Returns:
True if the element can be used as host for the railing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Architecture.Railing.SetPath(Autodesk.Revit.DB.CurveLoop)
Sets the railing path.
curveLoop:
The new curve array for the railing path.
The curveLoop should be continuous with curves which are only bounded lines and arcs on the same horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
curveLoop is empty.
-or-
curveLoop should only contain lines or arcs.
-or-
curveLoop is not continuous.
-or-
Not all curves in curveLoop are on the same horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The railing has incorrect internal data.
Since:
2017

Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new railing by specifying the railing path in the project document.
document:
The document.
curveLoop:
The railing path which the new railing will be created along with.
The curveLoop should be continuous with curves which are only bounded lines and arcs on the same horizontal plane.
railingTypeId:
The railing type of the new railing is to be created.
baseLevelId:
The base level on which the new railing will be created.
Returns:
The new railing instance if creation was successful, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
curveLoop is empty.
-or-
curveLoop should only contain lines or arcs.
-or-
curveLoop is not continuous.
-or-
Not all curves in curveLoop are on the same horizontal plane.
-or-
The railingTypeId is not a railing type.
-or-
The baseLevelId is not a valid level id for a railing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Architecture.RailingPlacementPosition)
Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element.
document:
The document.
stairsOrRampId:
The stairs or ramp to which the new railing will host.
The stairs or ramp should have no associated railings yet.
railingTypeId:
The railing type of the new railing is to be created.
placePosition:
The placement position of the new railing.
Returns:
The new railing instances successfully created on the stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsOrRampId is not a stairs or ramp element.
-or-
The railingTypeId is not a railing type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairsOrRampId already has associated railings or is in editing mode so association of railings is not permitted.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.HostId
The host of the railing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The hostId is not a valid railing host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013